import { Component } from "react";
// import './Modal.css';
// import './App.css';


export class Modal extends Component{

    state = {
        opened: false,
    }

    openModal = ()=>{
        this.setState({opend: true})
    }

    render(){
        return(
            <div className="backDrop">
                <div className="modal">
                    <p>Hello PoInt</p>
                    <button onClick={()=>{openModal()}}>Close</button>
                </div>
            </div>
        )
    }
}

export default Modal;
// Реалізація модального вікна в React з використанням методів життєвого циклу
// Створіть новий React проект або використайте вже існуючий.
// Створіть новий файл, наприклад Modal.js, для компонента, який відповідатиме за відображення модального вікна.
// Імпортуйте бібліотеку styled-components та стилі для модального вікна. 
// Створіть файли Modal.js та Modal.css.
// Створіть класовий компонент Modal, який розширює Component.
// В класовому компоненті визначте стан для відстеження відкриття/закриття модального вікна та методи для його відкриття, закриття та обробки клавіш.
// Використайте методи componentDidMount, componentWillUnmount, а також componentDidUpdate для відслідковування подій.
// Розробіть логіку для відображення та закриття модального вікна. Відобразіть модальне вікно при відкритті та закрийте при натисканні кнопок чи клавіші "Escape".
// Імпортуйте та використайте компонент Modal  в App.
// Запустіть додаток та переконайтеся, що модальне вікно відображається та може бути закрите.
// Додатково (опціонально): спробуйте змінити дизайн та додати анімацію до модального вікна.

